[
  {
    "first_name": "Abraham",
    "last_name": "Lincoln",
    "occupation": "Lawyer and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Abraham_Lincoln_O-77_matte_collodion_print.jpg/220px-Abraham_Lincoln_O-77_matte_collodion_print.jpg",
    "birthdate": "1809-02-12",
    "death": "1865-04-15",
    "country": "United States",
    "bio": "Abraham Lincoln was an American lawyer and politician who served as the 16th president of the United States from 1861 until his assassination in April 1865. Lincoln led the nation through the Civil War. In doing so, he preserved the Union, abolished slavery, strengthened the federal government, and modernized the economy."
  },
  {
    "first_name": "Willy",
    "last_name": "Brandt",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg/220px-Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg",
    "birthdate": "1913-12-18",
    "death": "1992-10-08",
    "country": "Germany",
    "bio": "Willy Brandt was a German statesman who was leader of the Social Democratic Party of Germany (SPD) from 1964 to 1987 and served as Chancellor of the Federal Republic of Germany (West Germany) from 1969 to 1974. He was awarded the Nobel Peace Prize in 1971 for his efforts to strengthen cooperation in western Europe through the EEC and to achieve reconciliation between West Germany and the countries of Eastern Europe. He was the first Social Democrat chancellor since 1930."
  },
  {
    "first_name": "Napoleon",
    "last_name": "Bonaparte",
    "occupation": "Statesman and military leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Jacques-Louis_David_-_The_Emperor_Napoleon_in_His_Study_at_the_Tuileries_-_Google_Art_Project.jpg/220px-Jacques-Louis_David_-_The_Emperor_Napoleon_in_His_Study_at_the_Tuileries_-_Google_Art_Project.jpg",
    "birthdate": "1769-08-15",
    "death": "1821-05-05",
    "country": "France",
    "bio": "Napoléon Bonaparte was a French statesman and military leader who rose to prominence during the French Revolution and led several successful campaigns during the French Revolutionary Wars. He was Emperor of the French from 1804 until 1814 and again briefly in 1815 during the Hundred Days. Napoleon dominated European and global affairs for more than a decade while leading France against a series of coalitions in the Napoleonic Wars. He won most of these wars and the vast majority of his battles, building a large empire that ruled over continental Europe before its final collapse in 1815. He is considered one of the greatest commanders in history, and his wars and campaigns are studied at military schools worldwide. Napoleon's political and cultural legacy has endured as one of the most celebrated and controversial leaders in human history."
  },
  {
    "first_name": "Oliver",
    "last_name": "Cromwell",
    "occupation": "Military and political leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Oliver_Cromwell_by_Samuel_Cooper.jpg/220px-Oliver_Cromwell_by_Samuel_Cooper.jpg",
    "birthdate": "1599-04-25",
    "death": "1658-09-03",
    "country": "United Kingdom",
    "bio": "Oliver Cromwell was an English military and political leader. He served as Lord Protector of the Commonwealth of England, Scotland, and Ireland from 1653 until his death, acting simultaneously as head of state and head of government of the new republic."
  },
  {
    "first_name": "Christopher",
    "last_name": "Columbus",
    "occupation": "Navigator",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Portrait_of_a_Man%2C_Said_to_be_Christopher_Columbus.jpg/220px-Portrait_of_a_Man%2C_Said_to_be_Christopher_Columbus.jpg",
    "birthdate": "1451-10-31",
    "death": "1506-05-20",
    "country": "Italy",
    "bio": "Christopher Columbus was an Italian explorer, navigator, and colonist who completed four voyages across the Atlantic Ocean under the auspices of the Catholic Monarchs of Spain. He led the first European expeditions to the Caribbean, Central America, and South America, initiating the permanent European colonization of the Americas. Columbus discovered the viable sailing route to the Americas, a continent which was not then known to the Old World. While what he thought he had discovered was a route to the Far East, he is credited with the opening of the Americas for conquest and settlement by Europeans."
  },
  {
    "first_name": "Plato",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Plato_Silanion_Musei_Capitolini_MC1377.jpg/220px-Plato_Silanion_Musei_Capitolini_MC1377.jpg",
    "birthdate": "-0428-01-01",
    "death": "-0348-01-01",
    "country": "Greece",
    "bio": "Plato was a philosopher in Classical Greece and the founder of the Academy in Athens, the first institution of higher learning in the Western world. He is widely considered the pivotal figure in the development of Western philosophy. Unlike nearly all of his philosophical contemporaries, Plato's entire work is believed to have survived intact for over 2,400 years."
  },
  {
    "first_name": "Nelson",
    "last_name": "Mandela",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Nelson_Mandela-2008_%28edit%29.jpg/220px-Nelson_Mandela-2008_%28edit%29.jpg",
    "birthdate": "1918-07-18",
    "death": "2013-12-05",
    "country": "South Africa",
    "bio": "Nelson Rolihlahla Mandela was a South African anti-apartheid revolutionary, political leader, and philanthropist who served as President of South Africa from 1994 to 1999. He was the country's first black head of state and the first elected in a fully representative democratic election."
  },
  {
    "first_name": "Barack",
    "last_name": "Obama",
    "occupation": "Attorney and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/President_Barack_Obama.jpg/220px-President_Barack_Obama.jpg",
    "birthdate": "1961-08-04",
    "death": "",
    "country": "United States",
    "bio": "Barack Hussein Obama II is an American attorney and politician who served as the 44th president of the United States from 2009 to 2017. A member of the Democratic Party, he was the first African American to be elected to the presidency. He previously served as a Senator from Illinois from 2005 to 2008"
  },
  {
    "first_name": "Tiradentes",
    "last_name": "",
    "occupation": "Dentist and Activist",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Oscar_Pereira_da_Silva_-_Retrato_de_Joaquim_Jos%C3%A9_da_Silva_Xavier_-_Tiradentes%2C_Acervo_do_Museu_Paulista_da_USP.jpg/220px-Oscar_Pereira_da_Silva_-_Retrato_de_Joaquim_Jos%C3%A9_da_Silva_Xavier_-_Tiradentes%2C_Acervo_do_Museu_Paulista_da_USP.jpg",
    "birthdate": "1746-11-12",
    "death": "1792-04-21",
    "country": "Brazil",
    "bio": "Joaquim José da Silva Xavier, known as Tiradentes, was a leading member of the Brazilian revolutionary movement known as Inconfidência Mineira, whose aim was full independence from Portuguese colonial power and creation of a Brazilian republic."
  },
  {
    "first_name": "Pedro II of Brazil",
    "last_name": "",
    "occupation": "Monarch",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Pedro_II_circa_1887b_transparent.png/220px-Pedro_II_circa_1887b_transparent.png",
    "birthdate": "1825-12-02",
    "death": "1891-12-05",
    "country": "Brazil",
    "bio": "Dom Pedro II, nicknamed \"the Magnanimous\", was the second and last monarch of the Empire of Brazil, reigning for over 58 years. He was born in Rio de Janeiro, the seventh child of Emperor Dom Pedro I of Brazil and Empress Dona Maria Leopoldina and thus a member of the Brazilian branch of the House of Braganza. His father's abrupt abdication and departure to Europe in 1831 left the five year-old as Emperor and led to a grim and lonely childhood and adolescence, obliged to spend his time studying in preparation for rule. He knew only brief moments of happiness and encountered few friends of his age. His experiences with court intrigues and political disputes during this period greatly affected his later character; he grew into a man with a strong sense of duty and devotion toward his country and his people, yet increasingly resentful of his role as monarch."
  },
  {
    "first_name": "Mao",
    "last_name": "Zedong",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Mao_Zedong_1963_%28cropped%29.jpg/220px-Mao_Zedong_1963_%28cropped%29.jpg",
    "birthdate": "1893-12-26",
    "death": "1976-09-09",
    "country": "China",
    "bio": "Mao Zedong, also known as Chairman Mao, was a Chinese communist revolutionary who became the founding father of the People's Republic of China, which he ruled as the Chairman of the Communist Party of China from its establishment in 1949 until his death in 1976. His theories, military strategies, and political policies are collectively known as Maoism."
  },
  {
    "first_name": "Confucius",
    "last_name": "",
    "occupation": "Philosopher and politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Confucius_Tang_Dynasty.jpg/220px-Confucius_Tang_Dynasty.jpg",
    "birthdate": "-0551-01-01",
    "death": "-0479-01-01",
    "country": "China",
    "bio": "Confucius was a Chinese teacher, editor, politician, and philosopher of the Spring and Autumn period of Chinese history."
  },
  {
    "first_name": "Maximilien",
    "last_name": "de Robespierre",
    "occupation": "Lawyer and politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Robespierre.jpg/220px-Robespierre.jpg",
    "birthdate": "1758-05-06",
    "death": "1794-07-28",
    "country": "France",
    "bio": "Maximilien François Marie Isidore de Robespierre was a French lawyer and politician, as well as one of the best known and most influential figures associated with the French Revolution and the Reign of Terror. As a member of the Estates-General, the Constituent Assembly and the Jacobin Club, Robespierre was an outspoken advocate for the poor and for democratic institutions. He campaigned for universal male suffrage in France, price controls on basic food commodities and the abolition of slavery in the French colonies. He was an ardent opponent of the death penalty, but played an important role in arranging the execution of many political opponents, and of King Louis XVI, which led to the establishment of a French Republic."
  },
  {
    "first_name": "Jean-Jacques",
    "last_name": "Rousseau",
    "occupation": "Philosopher and writer",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Maurice_Quentin_de_La_Tour_-_Portrait_of_Jean-Jacques_Rousseau_-_adjusted.jpg/220px-Maurice_Quentin_de_La_Tour_-_Portrait_of_Jean-Jacques_Rousseau_-_adjusted.jpg",
    "birthdate": "1712-06-28",
    "death": "1778-07-02",
    "country": "Switzerland",
    "bio": "Jean-Jacques Rousseau was a Genevan philosopher, writer and composer. Born in Geneva, his political philosophy influenced the progress of the Enlightenment throughout Europe, as well as aspects of the French Revolution and the development of modern political and educational thought."
  },
  {
    "first_name": "Queen",
    "last_name": "Victoria",
    "occupation": "Queen",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Queen_Victoria_by_Bassano.jpg/220px-Queen_Victoria_by_Bassano.jpg",
    "birthdate": "1819-05-24",
    "death": "1901-01-22",
    "country": "United Kingdom",
    "bio": "Victoria was Queen of the United Kingdom of Great Britain and Ireland from 20 June 1837 until her death. On 1 May 1876, she adopted the additional title of Empress of India. Her reign of 63 years and seven months was longer than that of any of her predecessors and is known as the Victorian era."
  },
  {
    "first_name": "Wilhelm",
    "last_name": "II",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kaiser_Wilhelm_II_of_Germany_-_1902.jpg/220px-Kaiser_Wilhelm_II_of_Germany_-_1902.jpg",
    "birthdate": "1859-01-27",
    "death": "1941-06-04",
    "country": "Germany",
    "bio": "Wilhelm II was the last German Emperor (Kaiser) and King of Prussia, reigning from 15 June 1888 until his abdication on 9 November 1918. He was the eldest grandchild of Queen Victoria of the United Kingdom and related to many monarchs and princes of Europe, most notably, King George V of the United Kingdom and Emperor Nicholas II of Russia."
  },
  {
    "first_name": "Martin",
    "last_name": "Luther",
    "occupation": "Priest",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Martin_Luther_by_Cranach-restoration.jpg/220px-Martin_Luther_by_Cranach-restoration.jpg",
    "birthdate": "1483-11-10",
    "death": "1546-02-18",
    "country": "Germany",
    "bio": "Martin Luther was a German professor of theology, composer, priest, monk, and a seminal figure in the Protestant Reformation."
  }
]
