[
  {
    "first_name": "Abraham",
    "last_name": "Lincoln",
    "occupation": "Lawyer and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Abraham_Lincoln_O-77_matte_collodion_print.jpg/220px-Abraham_Lincoln_O-77_matte_collodion_print.jpg",
    "birthdate": "1809-02-12",
    "death": "1865-04-15",
    "country": "United States",
    "bio": "Abraham Lincoln was an American lawyer and politician who served as the 16th president of the United States from 1861 until his assassination in April 1865. Lincoln led the nation through the Civil War. In doing so, he preserved the Union, abolished slavery, strengthened the federal government, and modernized the economy."
  },
  {
    "first_name": "Willy",
    "last_name": "Brandt",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg/220px-Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg",
    "birthdate": "1913-12-18",
    "death": "1992-10-08",
    "country": "Germany",
    "bio": "Willy Brandt was a German statesman who was leader of the Social Democratic Party of Germany (SPD) from 1964 to 1987 and served as Chancellor of the Federal Republic of Germany (West Germany) from 1969 to 1974. He was awarded the Nobel Peace Prize in 1971 for his efforts to strengthen cooperation in western Europe through the EEC and to achieve reconciliation between West Germany and the countries of Eastern Europe. He was the first Social Democrat chancellor since 1930."
  },
  {
    "first_name": "Napoleon",
    "last_name": "Bonaparte",
    "occupation": "Statesman and military leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Jacques-Louis_David_-_The_Emperor_Napoleon_in_His_Study_at_the_Tuileries_-_Google_Art_Project.jpg/220px-Jacques-Louis_David_-_The_Emperor_Napoleon_in_His_Study_at_the_Tuileries_-_Google_Art_Project.jpg",
    "birthdate": "1769-08-15",
    "death": "1821-05-05",
    "country": "France",
    "bio": "Napoléon Bonaparte was a French statesman and military leader who rose to prominence during the French Revolution and led several successful campaigns during the French Revolutionary Wars. He was Emperor of the French from 1804 until 1814 and again briefly in 1815 during the Hundred Days. Napoleon dominated European and global affairs for more than a decade while leading France against a series of coalitions in the Napoleonic Wars. He won most of these wars and the vast majority of his battles, building a large empire that ruled over continental Europe before its final collapse in 1815. He is considered one of the greatest commanders in history, and his wars and campaigns are studied at military schools worldwide. Napoleon's political and cultural legacy has endured as one of the most celebrated and controversial leaders in human history."
  },
  {
    "first_name": "Oliver",
    "last_name": "Cromwell",
    "occupation": "Military and political leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Oliver_Cromwell_by_Samuel_Cooper.jpg/220px-Oliver_Cromwell_by_Samuel_Cooper.jpg",
    "birthdate": "1599-04-25",
    "death": "1658-09-03",
    "country": "United Kingdom",
    "bio": "Oliver Cromwell was an English military and political leader. He served as Lord Protector of the Commonwealth of England, Scotland, and Ireland from 1653 until his death, acting simultaneously as head of state and head of government of the new republic."
  },
  {
    "first_name": "Christopher",
    "last_name": "Columbus",
    "occupation": "Navigator",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Portrait_of_a_Man%2C_Said_to_be_Christopher_Columbus.jpg/220px-Portrait_of_a_Man%2C_Said_to_be_Christopher_Columbus.jpg",
    "birthdate": "1451-10-31",
    "death": "1506-05-20",
    "country": "Italy",
    "bio": "Christopher Columbus was an Italian explorer, navigator, and colonist who completed four voyages across the Atlantic Ocean under the auspices of the Catholic Monarchs of Spain. He led the first European expeditions to the Caribbean, Central America, and South America, initiating the permanent European colonization of the Americas. Columbus discovered the viable sailing route to the Americas, a continent which was not then known to the Old World. While what he thought he had discovered was a route to the Far East, he is credited with the opening of the Americas for conquest and settlement by Europeans."
  },
  {
    "first_name": "Plato",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Plato_Silanion_Musei_Capitolini_MC1377.jpg/220px-Plato_Silanion_Musei_Capitolini_MC1377.jpg",
    "birthdate": "-0428-01-01",
    "death": "-0348-01-01",
    "country": "Greece",
    "bio": "Plato was a philosopher in Classical Greece and the founder of the Academy in Athens, the first institution of higher learning in the Western world. He is widely considered the pivotal figure in the development of Western philosophy. Unlike nearly all of his philosophical contemporaries, Plato's entire work is believed to have survived intact for over 2,400 years."
  },
  {
    "first_name": "Nelson",
    "last_name": "Mandela",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Nelson_Mandela-2008_%28edit%29.jpg/220px-Nelson_Mandela-2008_%28edit%29.jpg",
    "birthdate": "1918-07-18",
    "death": "2013-12-05",
    "country": "South Africa",
    "bio": "Nelson Rolihlahla Mandela was a South African anti-apartheid revolutionary, political leader, and philanthropist who served as President of South Africa from 1994 to 1999. He was the country's first black head of state and the first elected in a fully representative democratic election."
  },
  {
    "first_name": "Barack",
    "last_name": "Obama",
    "occupation": "Attorney and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/President_Barack_Obama.jpg/220px-President_Barack_Obama.jpg",
    "birthdate": "1961-08-04",
    "death": "",
    "country": "United States",
    "bio": "Barack Hussein Obama II is an American attorney and politician who served as the 44th president of the United States from 2009 to 2017. A member of the Democratic Party, he was the first African American to be elected to the presidency. He previously served as a Senator from Illinois from 2005 to 2008"
  },
  {
    "first_name": "Tiradentes",
    "last_name": "",
    "occupation": "Dentist and Activist",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Oscar_Pereira_da_Silva_-_Retrato_de_Joaquim_Jos%C3%A9_da_Silva_Xavier_-_Tiradentes%2C_Acervo_do_Museu_Paulista_da_USP.jpg/220px-Oscar_Pereira_da_Silva_-_Retrato_de_Joaquim_Jos%C3%A9_da_Silva_Xavier_-_Tiradentes%2C_Acervo_do_Museu_Paulista_da_USP.jpg",
    "birthdate": "1746-11-12",
    "death": "1792-04-21",
    "country": "Brazil",
    "bio": "Joaquim José da Silva Xavier, known as Tiradentes, was a leading member of the Brazilian revolutionary movement known as Inconfidência Mineira, whose aim was full independence from Portuguese colonial power and creation of a Brazilian republic."
  },
  {
    "first_name": "Pedro II of Brazil",
    "last_name": "",
    "occupation": "Monarch",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Pedro_II_circa_1887b_transparent.png/220px-Pedro_II_circa_1887b_transparent.png",
    "birthdate": "1825-12-02",
    "death": "1891-12-05",
    "country": "Brazil",
    "bio": "Dom Pedro II, nicknamed \"the Magnanimous\", was the second and last monarch of the Empire of Brazil, reigning for over 58 years. He was born in Rio de Janeiro, the seventh child of Emperor Dom Pedro I of Brazil and Empress Dona Maria Leopoldina and thus a member of the Brazilian branch of the House of Braganza. His father's abrupt abdication and departure to Europe in 1831 left the five year-old as Emperor and led to a grim and lonely childhood and adolescence, obliged to spend his time studying in preparation for rule. He knew only brief moments of happiness and encountered few friends of his age. His experiences with court intrigues and political disputes during this period greatly affected his later character; he grew into a man with a strong sense of duty and devotion toward his country and his people, yet increasingly resentful of his role as monarch."
  },
  {
    "first_name": "Mao",
    "last_name": "Zedong",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Mao_Zedong_1963_%28cropped%29.jpg/220px-Mao_Zedong_1963_%28cropped%29.jpg",
    "birthdate": "1893-12-26",
    "death": "1976-09-09",
    "country": "China",
    "bio": "Mao Zedong, also known as Chairman Mao, was a Chinese communist revolutionary who became the founding father of the People's Republic of China, which he ruled as the Chairman of the Communist Party of China from its establishment in 1949 until his death in 1976. His theories, military strategies, and political policies are collectively known as Maoism."
  },
  {
    "first_name": "Confucius",
    "last_name": "",
    "occupation": "Philosopher and politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Confucius_Tang_Dynasty.jpg/220px-Confucius_Tang_Dynasty.jpg",
    "birthdate": "-0551-01-01",
    "death": "-0479-01-01",
    "country": "China",
    "bio": "Confucius was a Chinese teacher, editor, politician, and philosopher of the Spring and Autumn period of Chinese history."
  },
  {
    "first_name": "Maximilien",
    "last_name": "de Robespierre",
    "occupation": "Lawyer and politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Robespierre.jpg/220px-Robespierre.jpg",
    "birthdate": "1758-05-06",
    "death": "1794-07-28",
    "country": "France",
    "bio": "Maximilien François Marie Isidore de Robespierre was a French lawyer and politician, as well as one of the best known and most influential figures associated with the French Revolution and the Reign of Terror. As a member of the Estates-General, the Constituent Assembly and the Jacobin Club, Robespierre was an outspoken advocate for the poor and for democratic institutions. He campaigned for universal male suffrage in France, price controls on basic food commodities and the abolition of slavery in the French colonies. He was an ardent opponent of the death penalty, but played an important role in arranging the execution of many political opponents, and of King Louis XVI, which led to the establishment of a French Republic."
  },
  {
    "first_name": "Jean-Jacques",
    "last_name": "Rousseau",
    "occupation": "Philosopher and writer",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Maurice_Quentin_de_La_Tour_-_Portrait_of_Jean-Jacques_Rousseau_-_adjusted.jpg/220px-Maurice_Quentin_de_La_Tour_-_Portrait_of_Jean-Jacques_Rousseau_-_adjusted.jpg",
    "birthdate": "1712-06-28",
    "death": "1778-07-02",
    "country": "Switzerland",
    "bio": "Jean-Jacques Rousseau was a Genevan philosopher, writer and composer. Born in Geneva, his political philosophy influenced the progress of the Enlightenment throughout Europe, as well as aspects of the French Revolution and the development of modern political and educational thought."
  },
  {
    "first_name": "Queen",
    "last_name": "Victoria",
    "occupation": "Queen",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Queen_Victoria_by_Bassano.jpg/220px-Queen_Victoria_by_Bassano.jpg",
    "birthdate": "1819-05-24",
    "death": "1901-01-22",
    "country": "United Kingdom",
    "bio": "Victoria was Queen of the United Kingdom of Great Britain and Ireland from 20 June 1837 until her death. On 1 May 1876, she adopted the additional title of Empress of India. Her reign of 63 years and seven months was longer than that of any of her predecessors and is known as the Victorian era."
  },
  {
    "first_name": "Wilhelm",
    "last_name": "II",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kaiser_Wilhelm_II_of_Germany_-_1902.jpg/220px-Kaiser_Wilhelm_II_of_Germany_-_1902.jpg",
    "birthdate": "1859-01-27",
    "death": "1941-06-04",
    "country": "Germany",
    "bio": "Wilhelm II was the last German Emperor (Kaiser) and King of Prussia, reigning from 15 June 1888 until his abdication on 9 November 1918. He was the eldest grandchild of Queen Victoria of the United Kingdom and related to many monarchs and princes of Europe, most notably, King George V of the United Kingdom and Emperor Nicholas II of Russia."
  },
  {
    "first_name": "Martin",
    "last_name": "Luther",
    "occupation": "Priest",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Martin_Luther_by_Cranach-restoration.jpg/220px-Martin_Luther_by_Cranach-restoration.jpg",
    "birthdate": "1483-11-10",
    "death": "1546-02-18",
    "country": "Germany",
    "bio": "Martin Luther was a German professor of theology, composer, priest, monk, and a seminal figure in the Protestant Reformation."
  },
  {
    "first_name": "Voltaire",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c0/Nicolas_de_Largilli%C3%A8re%2C_Fran%C3%A7ois-Marie_Arouet_dit_Voltaire_adjusted.png/220px-Nicolas_de_Largilli%C3%A8re%2C_Fran%C3%A7ois-Marie_Arouet_dit_Voltaire_adjusted.png",
    "birthdate": "1694-11-21",
    "death": "1778-05-30",
    "country": "France",
    "bio": "François-Marie Arouet, known by his nom de plume Voltaire, was a French Enlightenment writer, historian and philosopher famous for his wit, his criticism of Christianity, especially the Roman Catholic Church, and his advocacy of freedom of religion, freedom of speech, and separation of church and state."
  },
  {
    "first_name": "Karl",
    "last_name": "Marx",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Karl_Marx_001.jpg/220px-Karl_Marx_001.jpg",
    "birthdate": "1818-05-05",
    "death": "1883-03-14",
    "country": "Germany",
    "bio": "Karl Marx was a German philosopher, economist, historian, sociologist, political theorist, journalist and socialist revolutionary."
  },
  {
    "first_name": "Socrates",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Socrates_Louvre.jpg/220px-Socrates_Louvre.jpg",
    "birthdate": "-0470-01-01",
    "death": "-0399-01-01",
    "country": "Greece",
    "bio": "Socrates was a classical Greek (Athenian) philosopher credited as one of the founders of Western philosophy, and as being the first moral philosopher, of the Western ethical tradition of thought. An enigmatic figure, he made no writings, and is known chiefly through the accounts of classical writers writing after his lifetime, particularly his students Plato and Xenophon. Other sources include the contemporaneous Antisthenes, Aristippus, and Aeschines of Sphettos. Aristophanes, a playwright, is the only source to have written during his lifetime."
  },
  {
    "first_name": "Aristotle",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Aristotle_Altemps_Inv8575.jpg/220px-Aristotle_Altemps_Inv8575.jpg",
    "birthdate": "-0384-01-01",
    "death": "-0322-01-01",
    "country": "Greece",
    "bio": "Aristotle was an ancient Greek philosopher and scientist born in the city of Stagira, Chalkidiki, in the north of Classical Greece. Along with Plato, he is considered the \"Father of Western Philosophy\". Aristotle provided a complex and harmonious synthesis of the various existing philosophies prior to him, including those of Socrates and Plato, and it was above all from his teachings that the West inherited its fundamental intellectual lexicon, as well as problems and methods of inquiry. As a result, his philosophy has exerted a unique influence on almost every form of knowledge in the West and it continues to be central to the contemporary philosophical discussion."
  },
  {
    "first_name": "Simón",
    "last_name": "Bolívar",
    "occupation": "Military and Political Leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Simon-bolivar.jpg/220px-Simon-bolivar.jpg",
    "birthdate": "1783-07-24",
    "death": "1830-12-17",
    "country": "Venezuela",
    "bio": "Simón José Antonio de la Santísima Trinidad Bolívar Palacios Ponte y Blanco, generally known as Simón Bolívar and also colloquially as El Libertador, was a Venezuelan military and political leader who liberated from the Spanish Empire what are currently the republics of Venezuela, Bolivia, Colombia, Ecuador, Peru and Panama."
  },
  {
    "first_name": "Gengis",
    "last_name": "Khan",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/YuanEmperorAlbumGenghisPortrait.jpg/220px-YuanEmperorAlbumGenghisPortrait.jpg",
    "birthdate": "1162-01-01",
    "death": "1227-08-18",
    "country": "Mongolia",
    "bio": "Genghis Khan was the founder and first Great Khan of the Mongol Empire, which became the largest contiguous empire in history after his death. He came to power by uniting many of the nomadic tribes of Northeast Asia. After founding the Empire and being proclaimed \"Genghis Khan\", he launched the Mongol invasions that conquered most of Eurasia. Campaigns initiated in his lifetime include those against the Qara Khitai, Caucasus, and Khwarazmian, Western Xia and Jin dynasties. These campaigns were often accompanied by large-scale massacres of the civilian populations – especially in the Khwarazmian and Western Xia controlled lands. By the end of his life, the Mongol Empire occupied a substantial portion of Central Asia and China."
  },
  {
    "first_name": "Attila",
    "last_name": "",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Attila_%C3%A1br%C3%A1zol%C3%A1s_Wilhelm_Dilich_Ungarische_Chronica.jpg/220px-Attila_%C3%A1br%C3%A1zol%C3%A1s_Wilhelm_Dilich_Ungarische_Chronica.jpg",
    "birthdate": "0406-01-01",
    "death": "0452-03-01",
    "country": "Hungary",
    "bio": "Attila, frequently called Attila the Hun, was the ruler of the Huns from 434 until his death in March 453. He was also the leader of a tribal empire consisting of Huns, Ostrogoths, and Alans among others, in Central and Eastern Europe."
  },
  {
    "first_name": "Salvador",
    "last_name": "Allende",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Salvador_Allende_Gossens-.jpg",
    "birthdate": "1908-06-26",
    "death": "1973-11-09",
    "country": "Chile",
    "bio": "Salvador Guillermo Allende Gossens was a Chilean democratic socialist politician and physician, President of Chile from 1970 until 1973, and head of the Popular Unity political coalition government; he was the first Marxist ever to be elected to the national presidency of a liberal democracy in the entire world.Allende's involvement in Chilean political life spanned a period of nearly forty years, having covered the posts of senator, deputy and cabinet minister. As a life-long committed member of the Socialist Party of Chile, whose foundation he had actively contributed to, he unsuccessfully ran for the national presidency in the 1952, 1958, and 1964 elections. In 1970, he won the presidency in a close three-way race. He was elected in a run-off by Congress as no candidate had gained a majority.\nOn 11 September 1973, the military moved to oust Allende in a coup d'état supported by the United States Central Intelligence Agency (CIA). As troops surrounded La Moneda Palace, he gave his last speech vowing not to resign. Later that day, Allende committed suicide with an assault rifle, according to an investigation conducted by a Chilean court with the assistance of international experts in 2011.Following Allende's death, General Augusto Pinochet refused to return authority to a civilian government, and Chile was later ruled by a military junta that was in power up until 1990, ending more than four decades of uninterrupted democratic rule. The military junta that took over dissolved the Congress of Chile, suspended the Constitution, and began a persecution of alleged dissidents, in which thousands of civilians were kidnapped, tortured, and murdered."
  },
  {
    "first_name": "Juan",
    "last_name": "Perón",
    "occupation": "General and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/3/35/RETRATO_FOTOGR%C3%81FICO_DE_PER%C3%93N.jpg",
    "birthdate": "1895-10-08",
    "death": "1974-07-01",
    "country": "Argentina",
    "bio": "Juan Domingo Perón was an Argentine Army general and politician. After serving in several government positions, including Minister of Labor and Vice President, he was elected President of Argentina three times, serving from June 1946 to September 1955, when he was overthrown in a coup d'état, and then from October 1973 until his death in July 1974.\nDuring his first presidential term (1946–52), Perón was supported by his second wife, Eva Duarte (\"Evita\"), and they were immensely popular among many Argentines. Eva died in 1952, and Perón was elected to a second term, serving from 1952 until 1955. During the following period of two military dictatorships, interrupted by two civilian governments, the Peronist party was outlawed and Perón was exiled. When the left-wing Peronist Héctor Cámpora was elected President in 1973, Perón returned to Argentina and was soon after elected President for a third time. His third wife, María Estela Martínez, known as Isabel Perón, was elected as Vice President on his ticket and succeeded him as President upon his death in 1974.\nAlthough they are still controversial figures, Juan and Evita Perón are nonetheless considered icons by the Peronists. The Peróns' followers praised their efforts to eliminate poverty and to dignify labour, while their detractors considered them demagogues and dictators. The Peróns gave their name to the political movement known as Peronism, which in present-day Argentina is represented mainly by the Justicialist Party.\nPeronism is a political phenomenon that draws support from both the political left and political right. Peronism is not considered a traditional party, but a political movement, because of the wide variety of people who call themselves Peronists, and there is great controversy surrounding his personality. A number of following Argentinian presidents are considered Peronists, including administrations covering a majority of the democratic era: Héctor Cámpora, Isabel Perón, Adolfo Rodríguez Saá, Eduardo Duhalde, Néstor Kirchner and Cristina Kirchner."
  },
  {
    "first_name": "Leon",
    "last_name": "Trotski",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Bundesarchiv_Bild_183-R15068%2C_Leo_Dawidowitsch_Trotzki.jpg",
    "birthdate": "1879-11-07",
    "death": "1940-08-21",
    "country": "Russia",
    "bio": "Leon Trotsky was a Russian revolutionary, Marxist theorist, and Soviet politician whose particular strain of Marxist thought is known as Trotskyism.\nInitially supporting the Menshevik-Internationalists faction within the Russian Social Democratic Labour Party, he joined the Bolsheviks (\"majority\") just before the 1917 October Revolution, immediately becoming a leader within the Communist Party. He would go on to become one of the seven members of the first Politburo, founded in 1917 to manage the Bolshevik Revolution.During the early days of the Russian Soviet Federative Socialist Republic (RSFSR) and the Soviet Union, he served first as People's Commissar for Foreign Affairs and later as the founder and commander of the Red Army, with the title of People's Commissar of Military and Naval Affairs. He became a major figure in the Bolshevik victory in the Russian Civil War (1918–1922).After leading a failed struggle of the Left Opposition against the policies and rise of Joseph Stalin in the 1920s and against the increasing role of bureaucracy in the Soviet Union, Trotsky was removed as Commissar for Military and Naval Affairs (January 1925), removed from the Politburo (October 1926), removed from the Central Committee (October 1927), expelled from the Communist Party (November 1927), exiled to Alma–Ata (January 1928), and exiled from the Soviet Union (February 1929). As the head of the Fourth International, Trotsky continued to oppose the Stalinist bureaucracy in the Soviet Union while in exile.\nTrotsky was assassinated in Mexico City by Ramón Mercader, a Spanish-born NKVD agent. On 20 August 1940, Mercader attacked Trotsky with an ice axe and Trotsky died the next day in a hospital. Mercader acted upon instruction from Stalin and was nearly beaten to death by Trotsky's bodyguards, and spent the next 20 years in a Mexican prison for the murder. Stalin presented Mercader with an Order of Lenin in absentia.Trotsky's ideas formed the basis of Trotskyism, a major school of Marxist thought that opposes the theories of Stalinism. He was written out of the history books under Stalin, and was one of the few Soviet political figures who was not rehabilitated by the government under Nikita Khrushchev in the 1950s."
  },
  {
    "first_name": "Joseph",
    "last_name": "Stalin",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/4/43/Stalin_Full_Image.jpg",
    "birthdate": "1878-12-18",
    "death": "1953-03-05",
    "country": "Russia",
    "bio": "Joseph Vissarionovich Stalin was a Soviet revolutionary and politician of Georgian ethnicity. He ruled the Soviet Union from the mid–1920s until his death in 1953. Initially presiding over an oligarchic one-party system that governed by plurality, he became the de facto dictator of the Soviet state by the 1930s while holding the posts of General Secretary of the Communist Party of the Soviet Union (1922–1952) and Premier (1941–1953). A communist ideologically committed to the Leninist interpretation of Marxism, Stalin helped to formalise these ideas as Marxism–Leninism, while his own policies became known as Stalinism.\nBorn to a poor family in Gori, Russian Empire (now Georgia), Stalin joined the Marxist Russian Social Democratic Labour Party as a youth. He edited the party's newspaper, Pravda, and raised funds for Vladimir Lenin's Bolshevik faction via robberies, kidnappings, and protection rackets. Repeatedly arrested, he underwent several internal exiles. After the Bolsheviks seized power during the 1917 October Revolution and created a one-party state under Lenin's newly renamed Communist Party, Stalin joined its governing Politburo. Serving in the Russian Civil War before overseeing the Soviet Union's establishment in 1922, Stalin assumed leadership over the country following Lenin's 1924 death. During Stalin's rule, \"Socialism in One Country\" became a central tenet of the party's dogma. Under the Five-Year Plans, the country underwent agricultural collectivisation and rapid industrialization, creating a centralized command economy. This led to significant disruptions in food production that contributed to the famine of 1932–33. To eradicate accused \"enemies of the working class\", Stalin instituted the \"Great Purge\", in which over a million were imprisoned and at least 700,000 executed between 1934 and 1939.\nStalin's government promoted Marxism–Leninism abroad through the Communist International and supported anti-fascist movements throughout Europe during the 1930s, particularly in the Spanish Civil War. In 1939, it signed a non-aggression pact with Nazi Germany, resulting in the Soviet invasion of Poland. Germany ended the pact by invading the Soviet Union in 1941. Despite initial setbacks, the Soviet Red Army repelled the German incursion and captured Berlin in 1945, ending World War II in Europe. The Soviets annexed the Baltic states and helped establish Soviet-aligned governments throughout Central and Eastern Europe, China and North Korea. The Soviet Union and the United States emerged from the war as the two world superpowers. Tensions arose between the Soviet-backed Eastern Bloc and U.S.-backed Western Bloc which became known as the Cold War. Stalin led his country through its post-war reconstruction, during which it developed a nuclear weapon in 1949. In these years, the country experienced another major famine and an anti-semitic campaign peaking in the Doctors' plot. Stalin died in 1953 and was eventually succeeded by Nikita Khrushchev, who denounced his predecessor and initiated a de-Stalinisation process throughout Soviet society.\nWidely considered one of the 20th century's most significant figures, Stalin was the subject of a pervasive personality cult within the international Marxist–Leninist movement which revered him as a champion of the working class and world socialism. Since the dissolution of the Soviet Union in 1991, Stalin has retained popularity in Russia and Georgia as a victorious wartime leader who established the Soviet Union as a major world power. Conversely, his totalitarian government has been widely condemned for overseeing mass repressions, ethnic cleansing, hundreds of thousands of executions, and famines which killed millions."
  },
  {
    "first_name": "Emiliano",
    "last_name": "Zapata",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/6/69/116.-_MIX-3.2.56.0001_-_Emiliano_Zapata.tif",
    "birthdate": "1879-08-08",
    "death": "1919-04-10",
    "country": "Mexico",
    "bio": "Emiliano Zapata Salazar was a leading figure in the Mexican Revolution, the main leader of the peasant revolution in the state of Morelos, and the inspiration of the agrarian movement called Zapatismo.\nZapata was born in the rural village of Anenecuilco in Morelos State, where peasant communities were under increasing pressure from the small landowning class who monopolized land and water resources for sugar cane production with the support of dictator Porfirio Díaz. Zapata early on participated in political movements against Diaz and the landowning hacendados, and when the Revolution broke out in 1910 he was positioned as a central leader of the peasant revolt in Morelos. Cooperating with a number of other peasant leaders he formed the Liberation Army of the South, of which he soon became the undisputed leader. Zapata's forces contributed to the fall of Díaz, defeating the Federal Army in the Battle of Cuautla, but when the revolutionary leader Francisco I. Madero became president he disavowed the role of the Zapatistas, denouncing them as simple bandits. In November 1911, Zapata promulgated the Plan de Ayala which called for substantial land reforms, redistributing lands to the peasants. Madero sent the Federal Army to root out the Zapatistas in Morelos. Madero's generals employed a scorched earth policy, burning villages and forcibly removing their inhabitants, and drafting many men into the Army or sending them to forced labor camps in southern Mexico. This strengthened Zapata's standing among the peasants, and Zapata was able to drive the forces of Madero led by Victoriano Huerta out of Morelos. In a coup against Madero in February 1913, Huerta took power in Mexico, but a coalition of Constitutionalist forces in northern Mexico led by Venustiano Carranza, Álvaro Obregón and Francisco \"Pancho\" Villa ousted him in July 1914 with the support of Zapata's troops. Zapata did not recognize the authority that Carranza asserted as leader of the revolutionary movement, continuing his adherence to the Plan de Ayala.\nIn the aftermath of the revolutionaries' victory over Huerta, they attempted to sort out power relations in the Convention of Aguascalientes. Zapata and Villa broke with Carranza, and Mexico descended into civil war among the winners. Dismayed with the alliance with Villa, Zapata focused his energies on rebuilding society in Morelos which he now controlled, instituting the land reforms of the Plan de Ayala. As Carranza consolidated his power and defeated Villa in 1915, Zapata initiated guerrilla warfare against the Carrancistas, who in turn invaded Morelos, employing once again scorched-earth tactics to oust the Zapatista rebels. Zapata once again retook Morelos in 1917 and held most of the state against Carranza's troops until he was killed in an ambush in April 1919. Article 27 of the 1917 Mexican Constitution was drafted in response to his agrarian demands.After his death, Zapatista generals aligned with Obregón against Carranza and helped drive Carranza from power. In 1920, Zapatistas managed to obtain powerful posts in the governance of Morelos after Carranza's fall. They instituted many of the land reforms envisioned by Zapata in Morelos.\nZapata remains an iconic figure in Mexico, used both as a nationalist symbol as well as a symbol of the neo-Zapatista movement."
  },
  {
    "first_name": "Ho",
    "last_name": "Chi Minh",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Ho_Chi_Minh_1946.jpg",
    "birthdate": "1890-05-19",
    "death": "1969-09-02",
    "country": "Vietnam",
    "bio": "Hồ Chí Minh, born Nguyễn Sinh Cung, also known as Nguyễn Tất Thành, Nguyễn Ái Quốc, Bác Hồ or simply Bác, was a Vietnamese Communist revolutionary leader who was Chairman and First Secretary of the Workers' Party of Vietnam. He was also Prime Minister (1945–1955) and President (1945–1969) of the Democratic Republic of Vietnam (North Vietnam). He was a key figure in the foundation of the Democratic Republic of Vietnam in 1945 as well as the People's Army of Vietnam and the Viet Cong during the Vietnam War.\nHồ Chí Minh led the Việt Minh independence movement from 1941 onward, establishing the Communist-ruled Democratic Republic of Vietnam in 1945 and defeating the French Union in 1954 at the battle of Điện Biên Phủ. He officially stepped down from power in 1965 due to health problems. After the war, Saigon, the former capital of the Republic of Vietnam, was renamed Hồ Chí Minh City.\nAny description of Hồ Chí Minh's life before he came to power in Vietnam is necessarily fraught with ambiguity. He is known to have used at least 50 and perhaps as many as 200 pseudonyms. Both his place and date of birth are subjects of academic debate since neither is known with certainty. At least four existing official biographies vary on names, dates, places and other hard facts while unofficial biographies vary even more widely."
  },
  {
    "first_name": "Mahatma",
    "last_name": "Gandhi",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Portrait_Gandhi.jpg",
    "birthdate": "1869-10-02",
    "death": "1948-01-30",
    "country": "India",
    "bio": "Mohandas Karamchand Gandhi (; Hindustani: [ˈmoːɦəndaːs ˈkərəmtʃənd ˈɡaːndʱi] (listen); 2 October 1869 – 30 January 1948) was an Indian activist who was the leader of the Indian independence movement against British rule. Employing nonviolent civil disobedience, Gandhi led India to independence and inspired movements for civil rights and freedom across the world. The honorific Mahātmā (Sanskrit: \"high-souled\", \"venerable\") – applied to him first in 1914 in South Africa – is now used worldwide. In India, he is also called Bapu (Gujarati: endearment for father, papa) and Gandhi ji, and known as the Father of the Nation.Born and raised in a Hindu merchant caste family in coastal Gujarat, India, and trained in law at the Inner Temple, London, Gandhi first employed nonviolent civil disobedience as an expatriate lawyer in South Africa, in the resident Indian community's struggle for civil rights. After his return to India in 1915, he set about organising peasants, farmers, and urban labourers to protest against excessive land-tax and discrimination. Assuming leadership of the Indian National Congress in 1921, Gandhi led nationwide campaigns for various social causes and for achieving Swaraj or self-rule.\nGandhi led Indians in challenging the British-imposed salt tax with the 400 km (250 mi) Dandi Salt March in 1930, and later in calling for the British to Quit India in 1942. He was imprisoned for many years, upon many occasions, in both South Africa and India. He lived modestly in a self-sufficient residential community and wore the traditional Indian dhoti and shawl, woven with yarn hand-spun on a charkha. He ate simple vegetarian food, and also undertook long fasts as a means of both self-purification and political protest.\nGandhi's vision of an independent India based on religious pluralism, however, was challenged in the early 1940s by a new Muslim nationalism which was demanding a separate Muslim homeland carved out of India. Eventually, in August 1947, Britain granted independence, but the British Indian Empire was partitioned into two dominions, a Hindu-majority India and Muslim-majority Pakistan. As many displaced Hindus, Muslims, and Sikhs made their way to their new lands, religious violence broke out, especially in the Punjab and Bengal. Eschewing the official celebration of independence in Delhi, Gandhi visited the affected areas, attempting to provide solace. In the months following, he undertook several fasts unto death to stop religious violence. The last of these, undertaken on 12 January 1948 when he was 78, also had the indirect goal of pressuring India to pay out some cash assets owed to Pakistan. Some Indians thought Gandhi was too accommodating. Among them was Nathuram Godse, a Hindu nationalist, who assassinated Gandhi on 30 January 1948 by firing three bullets into his chest. Captured along with many of his co-conspirators and collaborators, Godse and his co-conspirator Narayan Apte were tried, convicted and executed while many of their other accomplices were given prison sentences.\nGandhi's birthday, 2 October, is commemorated in India as Gandhi Jayanti, a national holiday, and worldwide as the International Day of Nonviolence."
  },
  {
    "first_name": "Oruç",
    "last_name": "Reis",
    "occupation": "Governor and Captain",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Arudsch-barbarossa.jpg",
    "birthdate": "1474-01-01",
    "death": "1518-05-01",
    "country": "Turkey",
    "bio": "Oruç Reis was an Ottoman bey (governor) of Algiers and beylerbey (chief governor) of the West Mediterranean, and the elder brother of Hayreddin Barbarossa. He was born on the Ottoman island of Midilli (Lesbos in modern Greece) and was killed in battle against the Spanish at Tlemcen in the Ottoman Eyalet of Algeria.\nHe became known as Baba Oruç or Baba Aruj (Father Oruç) when he transported large numbers of Morisco, Muslim and Jewish refugees from Spain to North Africa; he was known in folk etymology in Europe as Barbarossa (which means Redbeard in Italian)."
  },
  {
    "first_name": "José Francisco",
    "last_name": "Barrundia",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/0/08/Jos%C3%A9_Francisco_Barrundia.jpg",
    "birthdate": "1787-05-12",
    "death": "1854-08-04",
    "country": "Guatemala",
    "bio": "José Francisco Barrundia y Cepeda was a liberal Central American politician. From June 26, 1829 to September 16, 1830 he was interim president of the United Provinces of Central America."
  },
  {
    "first_name": "Francisco",
    "last_name": "Morazán",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/7/73/General_Francisco_Moraz%C3%A1n.JPG",
    "birthdate": "1792-10-03",
    "death": "1842-09-15",
    "country": "Honduras",
    "bio": "Francisco Morazán was a Central American politician who was president of the Federal Republic of Central America from 1830 to 1839. Before he was president of Central America he was the head of state of Honduras. He rose to prominence at the battle of La Trinidad on November 11, 1827. Morazán then dominated the political and military scene of Central America until his execution in 1842.\nIn the political arena, Francisco Morazán was recognized as a visionary and great thinker, as he attempted to transform Central America into one large and progressive nation. He enacted liberal reforms in the new Federal Republic of Central America, including freedom of the press, freedom of speech and freedom of religion.  Morazán also limited church power by making marriage secular and abolishing government-aided tithing.\nThese reforms made him some powerful enemies, and his period of rule was marked by bitter infighting between liberals and conservatives. But through his military skills, Morazán was able to keep a firm  grip on power until 1837, when the Federal Republic became irrevocably fractured. This was exploited by the conservative leaders, who rallied around the leadership of Rafael Carrera and in order to protect their own interests, ended up dividing Central America into five nations."
  },
  {
    "first_name": "Rafael",
    "last_name": "Carrera",
    "occupation": "Politician and Military",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Jos%C3%A9_Rafael_Carrera_y_Turcios.jpg",
    "birthdate": "1814-10-24",
    "death": "1865-04-14",
    "country": "Guatemala",
    "bio": "José Rafael Carrera Turcios  was the president of Guatemala from 1844 to 1848 and from 1851 until his death in 1865, after being appointed President for Life in 1854. During his military career and presidency, new nations in Central America were facing numerous problems:  William Walker's invasions, liberal attempts to overthrow the Catholic Church and aristocrats' power, the Civil War in the United States, Mayan uprising in the east, Belize boundary dispute with England, and the wars in Mexico under Benito Juarez. This led to a rise of caudillos, a term that refers to charismatic populist leaders among the indigenous people.  Many regional and national caudillos were interested in power for their own gain. Carrera was an exception as he genuinely took the interests of Guatemala's Indian majority to heart.Backed by the Catholic Church, conservatives of the Aycinena clan led by Juan José de Aycinena y Piñol, and mestizo and indigenist peasants, he dominated politics in the first three decades of Guatemala's independence more than any other individual. He led the revolt against the liberal state government of Mariano Galvez in Guatemala, and then was instrumental in breaking up the Federal Republic of Central America that the liberals wanted. As a result, once the liberals took over power in Guatemala in 1871, Carrera's character and regime were dismissed and demonized, making him look as an illiterate who could not even write his own name and was a puppet of the aristocrats.  Over the years, even Marxist writers who wanted to show how the native Guatemalans have been exploited by the elites completely ignored Carrera's interest in them and accused him of racism and being a \"little king\"."
  },
  {
    "first_name": "Carlos Manuel",
    "last_name": "de Céspedes",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Carlos_Manuel_de_Cespedes.jpg",
    "birthdate": "1819-04-18",
    "death": "1874-02-27",
    "country": "Cuba",
    "bio": "Carlos Manuel de Céspedes del Castillo was a Cuban revolutionary hero. Cespedes, who was a plantation owner in Cuba, freed his slaves and made the declaration of Cuban independence in 1868 which started the Ten Years' War. (1868–78), which ultimately led to Cuban independence.\nBecause of his actions during the Independence War, he is known in Cuba as the \"Father of the Motherland\"."
  },
  {
    "first_name": "José",
    "last_name": "Martí",
    "occupation": "Writer and professor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/7/79/MartiJohnManuel_K_TRestauration.jpg",
    "birthdate": "1853-01-28",
    "death": "1895-05-19",
    "country": "Cuba",
    "bio": "José Julián Martí Pérez was a Cuban poet,  essayist,  journalist,  translator,  professor, and  publisher, who is considered a national hero and an important figure in Latin American literature. He was very politically active, and is considered an important revolutionary philosopher and political theorist. Through his writings and political activity, he became a symbol of Cuba's bid for independence against Spain in the 19th century, and is referred to as the \"Apostle of Cuban Independence.\" From adolescence, he dedicated his life to the promotion of liberty, political independence for Cuba, and intellectual independence for all Spanish Americans; his death was used as a cry for Cuban independence from Spain by both the Cuban revolutionaries and those Cubans previously reluctant to start a revolt. Martí was also used as a figurehead by the Cuban government throughout the government of Fidel Castro, and his writings were commonly cited as supporting socialism within Castro's administration.Born in Havana, Martí began his political activism at an early age. He traveled extensively in Spain, Latin America, and the United States, raising awareness and support for the cause of Cuban independence. His unification of the Cuban émigré community, particularly in Florida, was crucial to the success of the Cuban War of Independence against Spain. He was a key figure in the planning and execution of this war, as well as the designer of the Cuban Revolutionary Party and its ideology. He died in military action during the Battle of Dos Ríos on May 19, 1895.\nMartí is considered one of the great turn-of-the-century Latin American intellectuals. His written works include a series of poems, essays, letters, lectures, novel, and  a children's magazine. He wrote for numerous Latin American and American newspapers; he also founded a number of newspapers. His newspaper Patria was an important instrument in his campaign for Cuban independence. After his death, one of his poems from the book, \"Versos Sencillos\" (Simple Verses) was adapted to the song \"Guantanamera\", which has become the definitive patriotic song of Cuba.\nThe concepts of freedom, liberty, and democracy are prominent themes in all of his works, which were influential on the Nicaraguan poet Rubén Darío and the Chilean poet Gabriela Mistral."
  },
  {
    "first_name": "Lynden",
    "last_name": "Pindling",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/5/54/Sirlyndenpindling.jpg/220px-Sirlyndenpindling.jpg",
    "birthdate": "1929-03-21",
    "death": "2000-08-26",
    "country": "Bahamas",
    "bio": "The Right Excellent Sir Lynden Oscar Pindling is regarded as the \"Father of the Nation\" of the Bahamas, having led it to majority rule on 10 January 1967 and to independence on 10 July 1973.  He served as the first black premier of the Colony of the Bahama Islands from 1967 to 1969 and as Prime Minister of the Bahamas from 1969 to 1992. He was leader of the Progressive Liberal Party (PLP) from 1956 to 1997 when he resigned from public life under scandal. \nPindling won an unbroken string of general elections until 1992, when the PLP lost to the Free National Movement (FNM) led by Hubert Alexander Ingraham. He conceded defeat with the words: \"the people of this great little democracy have spoken in a most dignified and eloquent manner (and) the voice of the people, is the voice of God\".\nPindling was a member of the Privy Council of the United Kingdom, and he was appointed Knight Commander of the Order of St. Michael and St. George in 1982."
  },
  {
    "first_name": "Toussaint",
    "last_name": "Louverture",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/3/32/G%C3%A9n%C3%A9ral_Toussaint_Louverture.jpg",
    "birthdate": "1743-05-20",
    "death": "1803-04-07",
    "country": "Haiti",
    "bio": "François-Dominique Toussaint Louverture, also known as Toussaint L'Ouverture or Toussaint Bréda, was the best-known leader of the Haitian Revolution. He was a leader of the growing resistance. His military and political acumen saved the gains of the first Black insurrection in November 1791. He first fought for the Spanish against the French; then for France against Spain and Great Britain; and finally, for Saint-Domingue against Napoleonic France. He then helped transform the insurgency into a revolutionary movement, which by 1800 had turned Saint-Domingue, the most prosperous slave colony of the time, into the first free colonial society to have explicitly rejected race as the basis of social ranking.\nThough Louverture did not sever ties with France, his actions in 1800 constituted a de facto autonomous colony. The colony's constitution proclaimed him governor for life even against Napoleon Bonaparte's wishes. He died betrayed before the final and most violent stage of the armed conflict. However, his achievements set the grounds for the Black army's absolute victory and for Jean-Jacques Dessalines to declare the sovereign state of Haiti in January 1804. Louverture's prominent role in the Haitian success over colonialism and slavery had earned him the admiration of friends and detractors alike.Toussaint Louverture began his military career as a leader of the 1791 slave rebellion in the French colony of Saint-Domingue; he was by then a free man and a Jacobin. Initially allied with the Spaniards of neighboring Santo Domingo (modern Dominican Republic), Louverture switched allegiance to the French when they abolished slavery.  He gradually established control over the whole island and used political and military tactics to gain dominance over his rivals. Throughout his years in power, he worked to improve the economy and security of Saint-Domingue.  He restored the plantation system using paid labour, negotiated trade treaties with the UK and the United States, and maintained a large and well-disciplined army.In 1801, he promulgated an autonomist constitution for the colony, with himself as Governor-General for Life. In 1802 he was forced to resign by forces sent by Napoleon Bonaparte to restore French authority in the former colony.  He was deported to France, where he died in 1803. The Haitian Revolution continued under his lieutenant, Jean-Jacques Dessalines, who declared independence on 1 January 1804 and subsequently ordered the 1804 Haiti massacre. The French had lost two-thirds of forces sent to the island in an attempt to suppress the revolution; most died of yellow fever."
  },
  {
    "first_name": "George",
    "last_name": "Cadle Price",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/6/61/George_Cadle_Price.jpg",
    "birthdate": "1919-01-15",
    "death": "2011-09-19",
    "country": "Belize",
    "bio": "George Cadle Price, PC, OCC, was a Belizean statesman who served twice as the head of government of Belize from 1961–84 and 1989–93. He served as First Minister and Premier under British rule until independence in 1981 and was the nation's first prime minister after independence that year. He is considered to have been one of the principal architects of Belizean independence. Today he is referred to by many as the \"Father of the Nation.\" Price effectively dominated Belizean politics from the early 1960s until his 1996 retirement from party leadership, serving as the nation's head of government under various titles for most of that period.\nHe entered politics in 1947 with his election to the Belize City Council. In 1949, with the devaluation of the British Honduran dollar he, together with a group of citizens formed the People's Committee. It was the start of the \"peaceful, constructive Belizean revolution\". On 29 September 1950, he co-founded the People's United Party, which he led for four decades and which was devoted to the political and economic independence of the British colony, then known as British Honduras."
  },
  {
    "first_name": "Alexander",
    "last_name": "Bustamante",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d3/AlexBustamante.jpg/220px-AlexBustamante.jpg",
    "birthdate": "1884-02-24",
    "death": "1977-08-06",
    "country": "Jamaica",
    "bio": "Sir William Alexander Clarke Bustamante was a Jamaican politician and labour leader, who, in 1962 became the first prime minister of Jamaica. He founded the Bustamante Industrial Trade Union following the 1938 labour riots, and the Jamaican Labour Party in 1943. Bustamante is honoured in Jamaica with the title National Hero of Jamaica in recognition of his achievements."
  },
  {
    "first_name": "Tomás",
    "last_name": "Regalado",
    "occupation": "Politician and Military",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/0/07/Tom%C3%A1s_Regalado.jpg",
    "birthdate": "1860-11-07",
    "death": "1906-07-07",
    "country": "El Salvador",
    "bio": "General Tomás Regalado Romero was President of El Salvador from 14 November 1898 until 1 March 1903. He was a military ruler and gained power by deposing Rafael Antonio Gutiérrez, a man he had previously helped achieve control of the country by taking part in a conspiracy to oust Carlos Ezeta four years earlier. Elected to a four-year term in 1899, he promoted the construction of railways, declared an amnesty for political exiles, and began the construction of a National Theatre in Santa Ana."
  },
  {
    "first_name": "Anastasio",
    "last_name": "Somoza García",
    "occupation": "Dictator",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Somoza_1952_%28centr%C3%A9e%29.jpg",
    "birthdate": "1896-02-01",
    "death": "1956-09-29",
    "country": "Nicaragua",
    "bio": "Anastasio \"Tacho\" Somoza García (1 February 1896 – 29 September 1956) was officially the 21st President of Nicaragua from 1 January 1937 to 1 May 1947 and from 21 May 1950 to 29 September 1956, but ruled effectively as dictator from 1936 until his assassination. Anastasio Somoza started a dynasty that maintained absolute control over Nicaragua for 44 years.\nThe son of a wealthy coffee planter, Somoza was educated in the United States. After his return to Nicaragua, he helped oust President Adolfo Díaz. He became the foreign secretary and took the title of \"General\". With the help of the US Marine Corps, which occupied Nicaragua at the time, Somoza became the head of the National Guard. This gave him the power base to remove his wife's uncle, Juan Bautista Sacasa, from the presidency, and make himself president in 1937. In 1947, an ally nominally succeeded him, but he retained power.\nA month after his successor had been inaugurated, Somoza used the military to carry out a coup. The president was declared 'incapacitated' by Congress and Somoza served in his stead. Returning to power in his own name in 1951, he maintained an iron grip on his own Liberal Party while making a deal with the Conservatives; thus, he faced no opposition. This left him free to amass a huge personal fortune. On 21 September 1956, he was shot by poet Rigoberto López Pérez. Mortally wounded, he was flown to the Panama Canal Zone where he died a week later. His eldest son Luis Somoza Debayle who was Speaker of the House at the time of Somoza Garcia's Death took over and was elected in his own right in 1957 to serve until 1963, to be succeeded by Dr. Rene Schick who served until his death in 1966. His term was completed by Lorenzo Guerrero. In 1967 his younger brother Anastasio Somoza Debayle was elected to serve until 1972. He was reelected in 1974 after a Constituent Assembly that lasted from 1972 to 1974. During that time the country was ruled by a coalition Junta of conservatives and Liberals. Somoza Debayle was forced to resign in 1979 and was assassinated in exile in Paraguay the following year."
  },
  {
    "first_name": "Rafael",
    "last_name": "Trujillo",
    "occupation": "Soldier and Dictator",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Trujillo_1952.jpg",
    "birthdate": "1891-10-24",
    "death": "1961-05-30",
    "country": "Dominican Republic",
    "bio": "Rafael Leónidas Trujillo Molina (; Spanish: [rafaˈel leˈoniðas tɾuˈxiʝo]; 24 October 1891 – 30 May 1961), nicknamed El Jefe (Spanish: [el ˈxefe], \"The Chief\" or \"The Boss\"), was a Dominican politician, soldier and dictator, who ruled the Dominican Republic from  February 1930 until his assassination in May 1961. He served as president from 1930 to 1938 and again from 1942 to 1952, ruling for the rest of the time as an unelected military strongman under figurehead presidents. His 31 years in power, to Dominicans known as the Trujillo Era (Spanish: El Trujillato), are considered one of the bloodiest eras ever in the Americas, as well as a time of a personality cult, when monuments to Trujillo were in abundance. Trujillo and his regime were responsible for many deaths, including between 20,000 and 30,000 in the infamous Parsley massacre.During this long period of oppression and death, the Trujillo government extended its policy of state terrorism beyond national borders. Notorious examples of Trujillo’s reach abroad are the unsuccessful assassination attempt in Caracas against Venezuelan President Rómulo Betancourt (1960), the abduction and subsequent disappearance in New York City of the Spaniard Jesús Galíndez (1956), the murder of writer José Almoina in Mexico, also a Spaniard, and crimes committed against Cubans, Costa Ricans, Nicaraguans, Puerto Ricans, as well as United States citizens.The Trujillo era unfolded in a Hispanic Caribbean environment that was particularly fertile for dictatorial regimes. In the countries of the Caribbean Basin alone, his dictatorship was concurrent, in whole or in part, with those in Cuba, Nicaragua, Guatemala, El Salvador, Honduras, Venezuela, and Haiti. In retrospect, the Trujillo dictatorship has been characterized as more prominent and more brutal than those that rose and fell around it.Trujillo's rule brought the country a great deal of stability and prosperity throughout his 31-year reign. The price, however, was high—civil liberties were non-existent and human rights violations were routine. Due to the longevity of Trujillo's rule, a detached evaluation of his legacy is difficult. Supporters of Trujillo claim that he reorganized both the state and the economy, and left vast infrastructure to the country. From a moral point of view, however, a detached evaluation is not difficult at all. Everyone agrees on the brutality of his rule, and critics also claim that much of the country's wealth wound up in the hands of his family or close associates."
  },
  {
    "first_name": "Juan",
    "last_name": "Mora Fernández",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/9/90/Juan_Mora_Fern%C3%A1ndez.JPG",
    "birthdate": "1784-01-01",
    "death": "1854-01-01",
    "country": "Costa Rica",
    "bio": "Juan Mora Fernández (1784, San José, Costa Rica – 1854) was Costa Rica's first elected head of state.  He was considered a liberal and decided to move the capital from Cartago to Puntarenas.  Juan Mora was elected as the first head of state in 1825. He is remembered for instituting land reform, and he followed a progressive course.  As a consequence of his land reform structure, he inadvertently created an elite class of powerful coffee barons. The barons eventually overthrew one of his later successors, José María Alfaro Zamora."
  },
  {
    "first_name": "Arnulfo",
    "last_name": "Arias",
    "occupation": "Politician and Doctor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/4/41/Monumento_a_Arnulfo_Arias_Madrid..-.jpg",
    "birthdate": "1901-08-15",
    "death": "1988-08-10",
    "country": "Panama",
    "bio": "Arnulfo Arias Madrid (15 August 1901 – 10 August 1988) was a Panamanian politician, doctor, writer, and President of Panama on three occasions: 1940-41, 1949–51, and for 11 days in October 1968."
  },
  {
    "first_name": "Francisco de Paula",
    "last_name": "Santander",
    "occupation": "Military and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Santander_by_Acevedo_Bernal.jpg",
    "birthdate": "1792-04-02",
    "death": "1840-03-06",
    "country": "Colombia",
    "bio": "Francisco José de Paula Santander y Omaña (Villa del Rosario de Cúcuta, Colombia, April 2, 1792 – Santafé de Bogotá, Colombia, May 6, 1840), was a Colombian military and political leader during the 1810–1819 independence war of the United Provinces of New Granada (present-day Colombia). He was the acting President of Gran Colombia between 1819 and 1826, and later elected by Congress as the President of the Republic of New Granada between 1832 and 1837.  Santander came to be known as \"The Man of the Laws\" (\"El Hombre de las Leyes\")."
  },
  {
    "first_name": "Vicente",
    "last_name": "Rocafuerte",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/0/03/Vicente_Rocafuerte.jpg",
    "birthdate": "1783-05-01",
    "death": "1847-05-16",
    "country": "Ecuador",
    "bio": "Vicente Rocafuerte y Bejarano (May 1, 1783 – May 16, 1847) was an influential figure in Ecuadorian politics and President of Ecuador from September 10, 1834 to January 31, 1839.\nHe was born into an aristocratic family in Guayaquil, Ecuador, and as a youth, was sent to Madrid to finish his education. He returned to Ecuador in 1807, and committed himself to freeing his land, first from Spanish rule, and later from the Republic of Gran Colombia.\nAfter Ecuadorian independence, Rocafuerte was elected a member of the National Congress for Pichincha Province. He led the opposition to President Juan José Flores, who exiled him to Peru.\nRocafuerte returned, and on September 20, 1833, became Governor of Guayas Province. He revolted against Flores, but was defeated and imprisoned. Because of the respect he was held in by his many supporters, Rocafuerte negotiated a settlement with Flores, and was released from prison. The settlement allowed Flóres to finish his term in office, and promised Rocafuerte would become president afterwards, with Flores to head the army.\nDuring his presidency, Rocafuerte passed a new constitution in 1835, and gave greater protection to Native Americans in Ecuador.\nIn 1839, after Rocafuerte had left office, Flores was again elected president, and for some time there were no difficulties between the two men. However, after electoral irregularities in 1843, Flores annulled the 1835 constitution and passed a new one, called by Rocafuerte 'The Letter of Slavery'. When Flores took up a third term as president in 1843, Rocafuerte left Ecuador in protest. After a short rebellion, Rocafuerte and Vicente Ramón Roca overthrew Flores on March 6, 1845, and Roca became president of Ecuador later that year.\nUnder Vicente Ramón Roca's presidency, Rocafuerte was appointed as special representative to various South American countries. He died on May 16, 1847."
  },
  {
    "first_name": "Ramón",
    "last_name": "Castilla",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/3/3d/RamonCastilla.jpg",
    "birthdate": "1797-08-31",
    "death": "1867-05-30",
    "country": "Peru",
    "bio": "Ramón Castilla y Marquesado (Spanish pronunciation: [raˈmõŋ kasˈtiʝa]; 31 August 1797 – 30 May 1867) was a Peruvian caudillo who served as President of Peru three times as well as the Interim President of Peru (Revolution Self-proclaimed President) in 1863. His earliest prominent appearance in Peruvian history began with his participation in a commanding role of the army of the Libertadores that helped Peru become an independent nation. Later, he led the country when the economy boomed due to the exploitation of guano deposits. Castilla's governments are remembered for having abolished slavery and modernized the state.\nHe assumed the presidency for the first time after general Domingo Nieto's death for a short period in 1844, then in 1845 until 1851, again from 1855 to 1862 and, finally, during a brief period in 1863."
  },
  {
    "first_name": "José Gaspar",
    "last_name": "Rodríguez de Francia",
    "occupation": "Lawyer and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Dr_francia.JPG",
    "birthdate": "1840-09-20",
    "death": "1814-06-12",
    "country": "Paraguay",
    "bio": "José Gaspar Rodríguez de Francia y Velasco (6 January 1766 – 20 September 1840) was a Paraguayan lawyer and politician, and the first dictator (1814–1840) of Paraguay following its independence from the Spanish Viceroyalty of the Río de la Plata. His official title was \"Supreme and Perpetual Dictator of Paraguay\", but he was popularly known as El Supremo.\nHe is considered to be the chief ideologue and political leader of the faction that advocated for the full independence of Paraguay from the United Provinces of the Río de la Plata and the Empire of Brazil."
  },
  {
    "first_name": "José",
    "last_name": "Gervasio Artigas",
    "occupation": "Military and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Juan_Manuel_Blanes_-_Artigas_en_la_Ciudadela.jpg",
    "birthdate": "1764-06-19",
    "death": "1850-09-23",
    "country": "Uruguay",
    "bio": "José Gervasio Artigas Arnal (Spanish pronunciation: [xoˈse ɣeɾˈβa.sjo aɾˈti.ɣas aɾˈnal]; June 19, 1764 – September 23, 1850) was a national hero of Uruguay, sometimes called \"the father of Uruguayan nationhood\"."
  },
  {
    "first_name": "Víctor",
    "last_name": "Paz Estenssoro",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Victor_Paz_Estenssoro_1958.jpg",
    "birthdate": "1907-10-02",
    "death": "2001-06-07",
    "country": "Bolivia",
    "bio": "Ángel Víctor Paz Estenssoro (October 2, 1907 – June 7, 2001) was a Bolivian politician who served as President of Bolivia from 1952 to 1956, 1960 to 1964 and 1985 to 1989. He ran for president eight times (1947, 1951, 1960, 1964, 1978, 1979, 1980 and 1985) and was victorious in 1951, 1960, 1964 and 1985. His 1951 victory was annulled by a military junta led by Hugo Ballivián, and his 1964 victory was interrupted by the 1964 Bolivian coup d'état."
  }
]
