[
  {
    "first_name": "Abraham",
    "last_name": "Lincoln",
    "occupation": "Lawyer and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Abraham_Lincoln_O-77_matte_collodion_print.jpg/220px-Abraham_Lincoln_O-77_matte_collodion_print.jpg",
    "birthdate": "1809-02-12",
    "death": "1865-04-15",
    "country": "United States",
    "bio": "Abraham Lincoln was an American lawyer and politician who served as the 16th president of the United States from 1861 until his assassination in April 1865. Lincoln led the nation through the Civil War. In doing so, he preserved the Union, abolished slavery, strengthened the federal government, and modernized the economy."
  },
  {
    "first_name": "Willy",
    "last_name": "Brandt",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg/220px-Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg",
    "birthdate": "1913-12-18",
    "death": "1992-10-08",
    "country": "Germany",
    "bio": "Willy Brandt was a German statesman who was leader of the Social Democratic Party of Germany (SPD) from 1964 to 1987 and served as Chancellor of the Federal Republic of Germany (West Germany) from 1969 to 1974. He was awarded the Nobel Peace Prize in 1971 for his efforts to strengthen cooperation in western Europe through the EEC and to achieve reconciliation between West Germany and the countries of Eastern Europe. He was the first Social Democrat chancellor since 1930."
  },
  {
    "first_name": "Napoleon",
    "last_name": "Bonaparte",
    "occupation": "Statesman and military leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Jacques-Louis_David_-_The_Emperor_Napoleon_in_His_Study_at_the_Tuileries_-_Google_Art_Project.jpg/220px-Jacques-Louis_David_-_The_Emperor_Napoleon_in_His_Study_at_the_Tuileries_-_Google_Art_Project.jpg",
    "birthdate": "1769-08-15",
    "death": "1821-05-05",
    "country": "France",
    "bio": "Napoléon Bonaparte was a French statesman and military leader who rose to prominence during the French Revolution and led several successful campaigns during the French Revolutionary Wars. He was Emperor of the French from 1804 until 1814 and again briefly in 1815 during the Hundred Days. Napoleon dominated European and global affairs for more than a decade while leading France against a series of coalitions in the Napoleonic Wars. He won most of these wars and the vast majority of his battles, building a large empire that ruled over continental Europe before its final collapse in 1815. He is considered one of the greatest commanders in history, and his wars and campaigns are studied at military schools worldwide. Napoleon's political and cultural legacy has endured as one of the most celebrated and controversial leaders in human history."
  },
  {
    "first_name": "Oliver",
    "last_name": "Cromwell",
    "occupation": "Military and political leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Oliver_Cromwell_by_Samuel_Cooper.jpg/220px-Oliver_Cromwell_by_Samuel_Cooper.jpg",
    "birthdate": "1599-04-25",
    "death": "1658-09-03",
    "country": "United Kingdom",
    "bio": "Oliver Cromwell was an English military and political leader. He served as Lord Protector of the Commonwealth of England, Scotland, and Ireland from 1653 until his death, acting simultaneously as head of state and head of government of the new republic."
  },
  {
    "first_name": "Christopher",
    "last_name": "Columbus",
    "occupation": "Navigator",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Portrait_of_a_Man%2C_Said_to_be_Christopher_Columbus.jpg/220px-Portrait_of_a_Man%2C_Said_to_be_Christopher_Columbus.jpg",
    "birthdate": "1451-10-31",
    "death": "1506-05-20",
    "country": "Italy",
    "bio": "Christopher Columbus was an Italian explorer, navigator, and colonist who completed four voyages across the Atlantic Ocean under the auspices of the Catholic Monarchs of Spain. He led the first European expeditions to the Caribbean, Central America, and South America, initiating the permanent European colonization of the Americas. Columbus discovered the viable sailing route to the Americas, a continent which was not then known to the Old World. While what he thought he had discovered was a route to the Far East, he is credited with the opening of the Americas for conquest and settlement by Europeans."
  },
  {
    "first_name": "Plato",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Plato_Silanion_Musei_Capitolini_MC1377.jpg/220px-Plato_Silanion_Musei_Capitolini_MC1377.jpg",
    "birthdate": "-0428-01-01",
    "death": "-0348-01-01",
    "country": "Greece",
    "bio": "Plato was a philosopher in Classical Greece and the founder of the Academy in Athens, the first institution of higher learning in the Western world. He is widely considered the pivotal figure in the development of Western philosophy. Unlike nearly all of his philosophical contemporaries, Plato's entire work is believed to have survived intact for over 2,400 years."
  },
  {
    "first_name": "Nelson",
    "last_name": "Mandela",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Nelson_Mandela-2008_%28edit%29.jpg/220px-Nelson_Mandela-2008_%28edit%29.jpg",
    "birthdate": "1918-07-18",
    "death": "2013-12-05",
    "country": "South Africa",
    "bio": "Nelson Rolihlahla Mandela was a South African anti-apartheid revolutionary, political leader, and philanthropist who served as President of South Africa from 1994 to 1999. He was the country's first black head of state and the first elected in a fully representative democratic election."
  },
  {
    "first_name": "Barack",
    "last_name": "Obama",
    "occupation": "Attorney and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/President_Barack_Obama.jpg/220px-President_Barack_Obama.jpg",
    "birthdate": "1961-08-04",
    "death": "",
    "country": "United States",
    "bio": "Barack Hussein Obama II is an American attorney and politician who served as the 44th president of the United States from 2009 to 2017. A member of the Democratic Party, he was the first African American to be elected to the presidency. He previously served as a Senator from Illinois from 2005 to 2008"
  },
  {
    "first_name": "Tiradentes",
    "last_name": "",
    "occupation": "Dentist and Activist",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Oscar_Pereira_da_Silva_-_Retrato_de_Joaquim_Jos%C3%A9_da_Silva_Xavier_-_Tiradentes%2C_Acervo_do_Museu_Paulista_da_USP.jpg/220px-Oscar_Pereira_da_Silva_-_Retrato_de_Joaquim_Jos%C3%A9_da_Silva_Xavier_-_Tiradentes%2C_Acervo_do_Museu_Paulista_da_USP.jpg",
    "birthdate": "1746-11-12",
    "death": "1792-04-21",
    "country": "Brazil",
    "bio": "Joaquim José da Silva Xavier, known as Tiradentes, was a leading member of the Brazilian revolutionary movement known as Inconfidência Mineira, whose aim was full independence from Portuguese colonial power and creation of a Brazilian republic."
  },
  {
    "first_name": "Pedro II of Brazil",
    "last_name": "",
    "occupation": "Monarch",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Pedro_II_circa_1887b_transparent.png/220px-Pedro_II_circa_1887b_transparent.png",
    "birthdate": "1825-12-02",
    "death": "1891-12-05",
    "country": "Brazil",
    "bio": "Dom Pedro II, nicknamed \"the Magnanimous\", was the second and last monarch of the Empire of Brazil, reigning for over 58 years. He was born in Rio de Janeiro, the seventh child of Emperor Dom Pedro I of Brazil and Empress Dona Maria Leopoldina and thus a member of the Brazilian branch of the House of Braganza. His father's abrupt abdication and departure to Europe in 1831 left the five year-old as Emperor and led to a grim and lonely childhood and adolescence, obliged to spend his time studying in preparation for rule. He knew only brief moments of happiness and encountered few friends of his age. His experiences with court intrigues and political disputes during this period greatly affected his later character; he grew into a man with a strong sense of duty and devotion toward his country and his people, yet increasingly resentful of his role as monarch."
  },
  {
    "first_name": "Mao",
    "last_name": "Zedong",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Mao_Zedong_1963_%28cropped%29.jpg/220px-Mao_Zedong_1963_%28cropped%29.jpg",
    "birthdate": "1893-12-26",
    "death": "1976-09-09",
    "country": "China",
    "bio": "Mao Zedong, also known as Chairman Mao, was a Chinese communist revolutionary who became the founding father of the People's Republic of China, which he ruled as the Chairman of the Communist Party of China from its establishment in 1949 until his death in 1976. His theories, military strategies, and political policies are collectively known as Maoism."
  },
  {
    "first_name": "Confucius",
    "last_name": "",
    "occupation": "Philosopher and politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Confucius_Tang_Dynasty.jpg/220px-Confucius_Tang_Dynasty.jpg",
    "birthdate": "-0551-01-01",
    "death": "-0479-01-01",
    "country": "China",
    "bio": "Confucius was a Chinese teacher, editor, politician, and philosopher of the Spring and Autumn period of Chinese history."
  },
  {
    "first_name": "Maximilien",
    "last_name": "de Robespierre",
    "occupation": "Lawyer and politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Robespierre.jpg/220px-Robespierre.jpg",
    "birthdate": "1758-05-06",
    "death": "1794-07-28",
    "country": "France",
    "bio": "Maximilien François Marie Isidore de Robespierre was a French lawyer and politician, as well as one of the best known and most influential figures associated with the French Revolution and the Reign of Terror. As a member of the Estates-General, the Constituent Assembly and the Jacobin Club, Robespierre was an outspoken advocate for the poor and for democratic institutions. He campaigned for universal male suffrage in France, price controls on basic food commodities and the abolition of slavery in the French colonies. He was an ardent opponent of the death penalty, but played an important role in arranging the execution of many political opponents, and of King Louis XVI, which led to the establishment of a French Republic."
  },
  {
    "first_name": "Jean-Jacques",
    "last_name": "Rousseau",
    "occupation": "Philosopher and writer",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Maurice_Quentin_de_La_Tour_-_Portrait_of_Jean-Jacques_Rousseau_-_adjusted.jpg/220px-Maurice_Quentin_de_La_Tour_-_Portrait_of_Jean-Jacques_Rousseau_-_adjusted.jpg",
    "birthdate": "1712-06-28",
    "death": "1778-07-02",
    "country": "Switzerland",
    "bio": "Jean-Jacques Rousseau was a Genevan philosopher, writer and composer. Born in Geneva, his political philosophy influenced the progress of the Enlightenment throughout Europe, as well as aspects of the French Revolution and the development of modern political and educational thought."
  },
  {
    "first_name": "Queen",
    "last_name": "Victoria",
    "occupation": "Queen",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Queen_Victoria_by_Bassano.jpg/220px-Queen_Victoria_by_Bassano.jpg",
    "birthdate": "1819-05-24",
    "death": "1901-01-22",
    "country": "United Kingdom",
    "bio": "Victoria was Queen of the United Kingdom of Great Britain and Ireland from 20 June 1837 until her death. On 1 May 1876, she adopted the additional title of Empress of India. Her reign of 63 years and seven months was longer than that of any of her predecessors and is known as the Victorian era."
  },
  {
    "first_name": "Wilhelm",
    "last_name": "II",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kaiser_Wilhelm_II_of_Germany_-_1902.jpg/220px-Kaiser_Wilhelm_II_of_Germany_-_1902.jpg",
    "birthdate": "1859-01-27",
    "death": "1941-06-04",
    "country": "Germany",
    "bio": "Wilhelm II was the last German Emperor (Kaiser) and King of Prussia, reigning from 15 June 1888 until his abdication on 9 November 1918. He was the eldest grandchild of Queen Victoria of the United Kingdom and related to many monarchs and princes of Europe, most notably, King George V of the United Kingdom and Emperor Nicholas II of Russia."
  },
  {
    "first_name": "Martin",
    "last_name": "Luther",
    "occupation": "Priest",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Martin_Luther_by_Cranach-restoration.jpg/220px-Martin_Luther_by_Cranach-restoration.jpg",
    "birthdate": "1483-11-10",
    "death": "1546-02-18",
    "country": "Germany",
    "bio": "Martin Luther was a German professor of theology, composer, priest, monk, and a seminal figure in the Protestant Reformation."
  },
  {
    "first_name": "Voltaire",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c0/Nicolas_de_Largilli%C3%A8re%2C_Fran%C3%A7ois-Marie_Arouet_dit_Voltaire_adjusted.png/220px-Nicolas_de_Largilli%C3%A8re%2C_Fran%C3%A7ois-Marie_Arouet_dit_Voltaire_adjusted.png",
    "birthdate": "1694-11-21",
    "death": "1778-05-30",
    "country": "France",
    "bio": "François-Marie Arouet, known by his nom de plume Voltaire, was a French Enlightenment writer, historian and philosopher famous for his wit, his criticism of Christianity, especially the Roman Catholic Church, and his advocacy of freedom of religion, freedom of speech, and separation of church and state."
  },
  {
    "first_name": "Karl",
    "last_name": "Marx",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Karl_Marx_001.jpg/220px-Karl_Marx_001.jpg",
    "birthdate": "1818-05-05",
    "death": "1883-03-14",
    "country": "Germany",
    "bio": "Karl Marx was a German philosopher, economist, historian, sociologist, political theorist, journalist and socialist revolutionary."
  },
  {
    "first_name": "Socrates",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Socrates_Louvre.jpg/220px-Socrates_Louvre.jpg",
    "birthdate": "-0470-01-01",
    "death": "-0399-01-01",
    "country": "Greece",
    "bio": "Socrates was a classical Greek (Athenian) philosopher credited as one of the founders of Western philosophy, and as being the first moral philosopher, of the Western ethical tradition of thought. An enigmatic figure, he made no writings, and is known chiefly through the accounts of classical writers writing after his lifetime, particularly his students Plato and Xenophon. Other sources include the contemporaneous Antisthenes, Aristippus, and Aeschines of Sphettos. Aristophanes, a playwright, is the only source to have written during his lifetime."
  },
  {
    "first_name": "Aristotle",
    "last_name": "",
    "occupation": "Philosopher",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Aristotle_Altemps_Inv8575.jpg/220px-Aristotle_Altemps_Inv8575.jpg",
    "birthdate": "-0384-01-01",
    "death": "-0322-01-01",
    "country": "Greece",
    "bio": "Aristotle was an ancient Greek philosopher and scientist born in the city of Stagira, Chalkidiki, in the north of Classical Greece. Along with Plato, he is considered the \"Father of Western Philosophy\". Aristotle provided a complex and harmonious synthesis of the various existing philosophies prior to him, including those of Socrates and Plato, and it was above all from his teachings that the West inherited its fundamental intellectual lexicon, as well as problems and methods of inquiry. As a result, his philosophy has exerted a unique influence on almost every form of knowledge in the West and it continues to be central to the contemporary philosophical discussion."
  },
  {
    "first_name": "Simón",
    "last_name": "Bolívar",
    "occupation": "Military and Political Leader",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Simon-bolivar.jpg/220px-Simon-bolivar.jpg",
    "birthdate": "1783-07-24",
    "death": "1830-12-17",
    "country": "Venezuela",
    "bio": "Simón José Antonio de la Santísima Trinidad Bolívar Palacios Ponte y Blanco, generally known as Simón Bolívar and also colloquially as El Libertador, was a Venezuelan military and political leader who liberated from the Spanish Empire what are currently the republics of Venezuela, Bolivia, Colombia, Ecuador, Peru and Panama."
  },
  {
    "first_name": "Gengis",
    "last_name": "Khan",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/YuanEmperorAlbumGenghisPortrait.jpg/220px-YuanEmperorAlbumGenghisPortrait.jpg",
    "birthdate": "1162-01-01",
    "death": "1227-08-18",
    "country": "Mongolia",
    "bio": "Genghis Khan was the founder and first Great Khan of the Mongol Empire, which became the largest contiguous empire in history after his death. He came to power by uniting many of the nomadic tribes of Northeast Asia. After founding the Empire and being proclaimed \"Genghis Khan\", he launched the Mongol invasions that conquered most of Eurasia. Campaigns initiated in his lifetime include those against the Qara Khitai, Caucasus, and Khwarazmian, Western Xia and Jin dynasties. These campaigns were often accompanied by large-scale massacres of the civilian populations – especially in the Khwarazmian and Western Xia controlled lands. By the end of his life, the Mongol Empire occupied a substantial portion of Central Asia and China."
  },
  {
    "first_name": "Attila",
    "last_name": "",
    "occupation": "Emperor",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Attila_%C3%A1br%C3%A1zol%C3%A1s_Wilhelm_Dilich_Ungarische_Chronica.jpg/220px-Attila_%C3%A1br%C3%A1zol%C3%A1s_Wilhelm_Dilich_Ungarische_Chronica.jpg",
    "birthdate": "0406-01-01",
    "death": "0452-03-01",
    "country": "Hungary",
    "bio": "Attila, frequently called Attila the Hun, was the ruler of the Huns from 434 until his death in March 453. He was also the leader of a tribal empire consisting of Huns, Ostrogoths, and Alans among others, in Central and Eastern Europe."
  },
  {
    "first_name": "Salvador",
    "last_name": "Allende",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Salvador_Allende_Gossens-.jpg",
    "birthdate": "1908-06-26",
    "death": "1973-11-09",
    "country": "Chile",
    "bio": "Salvador Guillermo Allende Gossens was a Chilean democratic socialist politician and physician, President of Chile from 1970 until 1973, and head of the Popular Unity political coalition government; he was the first Marxist ever to be elected to the national presidency of a liberal democracy in the entire world.Allende's involvement in Chilean political life spanned a period of nearly forty years, having covered the posts of senator, deputy and cabinet minister. As a life-long committed member of the Socialist Party of Chile, whose foundation he had actively contributed to, he unsuccessfully ran for the national presidency in the 1952, 1958, and 1964 elections. In 1970, he won the presidency in a close three-way race. He was elected in a run-off by Congress as no candidate had gained a majority.\nOn 11 September 1973, the military moved to oust Allende in a coup d'état supported by the United States Central Intelligence Agency (CIA). As troops surrounded La Moneda Palace, he gave his last speech vowing not to resign. Later that day, Allende committed suicide with an assault rifle, according to an investigation conducted by a Chilean court with the assistance of international experts in 2011.Following Allende's death, General Augusto Pinochet refused to return authority to a civilian government, and Chile was later ruled by a military junta that was in power up until 1990, ending more than four decades of uninterrupted democratic rule. The military junta that took over dissolved the Congress of Chile, suspended the Constitution, and began a persecution of alleged dissidents, in which thousands of civilians were kidnapped, tortured, and murdered."
  },
  {
    "first_name": "Juan",
    "last_name": "Perón",
    "occupation": "General and Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/3/35/RETRATO_FOTOGR%C3%81FICO_DE_PER%C3%93N.jpg",
    "birthdate": "1895-10-08",
    "death": "1974-07-01",
    "country": "Argentina",
    "bio": "Juan Domingo Perón was an Argentine Army general and politician. After serving in several government positions, including Minister of Labor and Vice President, he was elected President of Argentina three times, serving from June 1946 to September 1955, when he was overthrown in a coup d'état, and then from October 1973 until his death in July 1974.\nDuring his first presidential term (1946–52), Perón was supported by his second wife, Eva Duarte (\"Evita\"), and they were immensely popular among many Argentines. Eva died in 1952, and Perón was elected to a second term, serving from 1952 until 1955. During the following period of two military dictatorships, interrupted by two civilian governments, the Peronist party was outlawed and Perón was exiled. When the left-wing Peronist Héctor Cámpora was elected President in 1973, Perón returned to Argentina and was soon after elected President for a third time. His third wife, María Estela Martínez, known as Isabel Perón, was elected as Vice President on his ticket and succeeded him as President upon his death in 1974.\nAlthough they are still controversial figures, Juan and Evita Perón are nonetheless considered icons by the Peronists. The Peróns' followers praised their efforts to eliminate poverty and to dignify labour, while their detractors considered them demagogues and dictators. The Peróns gave their name to the political movement known as Peronism, which in present-day Argentina is represented mainly by the Justicialist Party.\nPeronism is a political phenomenon that draws support from both the political left and political right. Peronism is not considered a traditional party, but a political movement, because of the wide variety of people who call themselves Peronists, and there is great controversy surrounding his personality. A number of following Argentinian presidents are considered Peronists, including administrations covering a majority of the democratic era: Héctor Cámpora, Isabel Perón, Adolfo Rodríguez Saá, Eduardo Duhalde, Néstor Kirchner and Cristina Kirchner."
  },
  {
    "first_name": "Leon",
    "last_name": "Trotski",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Bundesarchiv_Bild_183-R15068%2C_Leo_Dawidowitsch_Trotzki.jpg",
    "birthdate": "1879-11-07",
    "death": "1940-08-21",
    "country": "Russia",
    "bio": "Leon Trotsky was a Russian revolutionary, Marxist theorist, and Soviet politician whose particular strain of Marxist thought is known as Trotskyism.\nInitially supporting the Menshevik-Internationalists faction within the Russian Social Democratic Labour Party, he joined the Bolsheviks (\"majority\") just before the 1917 October Revolution, immediately becoming a leader within the Communist Party. He would go on to become one of the seven members of the first Politburo, founded in 1917 to manage the Bolshevik Revolution.During the early days of the Russian Soviet Federative Socialist Republic (RSFSR) and the Soviet Union, he served first as People's Commissar for Foreign Affairs and later as the founder and commander of the Red Army, with the title of People's Commissar of Military and Naval Affairs. He became a major figure in the Bolshevik victory in the Russian Civil War (1918–1922).After leading a failed struggle of the Left Opposition against the policies and rise of Joseph Stalin in the 1920s and against the increasing role of bureaucracy in the Soviet Union, Trotsky was removed as Commissar for Military and Naval Affairs (January 1925), removed from the Politburo (October 1926), removed from the Central Committee (October 1927), expelled from the Communist Party (November 1927), exiled to Alma–Ata (January 1928), and exiled from the Soviet Union (February 1929). As the head of the Fourth International, Trotsky continued to oppose the Stalinist bureaucracy in the Soviet Union while in exile.\nTrotsky was assassinated in Mexico City by Ramón Mercader, a Spanish-born NKVD agent. On 20 August 1940, Mercader attacked Trotsky with an ice axe and Trotsky died the next day in a hospital. Mercader acted upon instruction from Stalin and was nearly beaten to death by Trotsky's bodyguards, and spent the next 20 years in a Mexican prison for the murder. Stalin presented Mercader with an Order of Lenin in absentia.Trotsky's ideas formed the basis of Trotskyism, a major school of Marxist thought that opposes the theories of Stalinism. He was written out of the history books under Stalin, and was one of the few Soviet political figures who was not rehabilitated by the government under Nikita Khrushchev in the 1950s."
  },
  {
    "first_name": "Joseph",
    "last_name": "Stalin",
    "occupation": "Politician",
    "photo": "https://upload.wikimedia.org/wikipedia/commons/4/43/Stalin_Full_Image.jpg",
    "birthdate": "1878-12-18",
    "death": "1953-03-05",
    "country": "Russia",
    "bio": "Joseph Vissarionovich Stalin was a Soviet revolutionary and politician of Georgian ethnicity. He ruled the Soviet Union from the mid–1920s until his death in 1953. Initially presiding over an oligarchic one-party system that governed by plurality, he became the de facto dictator of the Soviet state by the 1930s while holding the posts of General Secretary of the Communist Party of the Soviet Union (1922–1952) and Premier (1941–1953). A communist ideologically committed to the Leninist interpretation of Marxism, Stalin helped to formalise these ideas as Marxism–Leninism, while his own policies became known as Stalinism.\nBorn to a poor family in Gori, Russian Empire (now Georgia), Stalin joined the Marxist Russian Social Democratic Labour Party as a youth. He edited the party's newspaper, Pravda, and raised funds for Vladimir Lenin's Bolshevik faction via robberies, kidnappings, and protection rackets. Repeatedly arrested, he underwent several internal exiles. After the Bolsheviks seized power during the 1917 October Revolution and created a one-party state under Lenin's newly renamed Communist Party, Stalin joined its governing Politburo. Serving in the Russian Civil War before overseeing the Soviet Union's establishment in 1922, Stalin assumed leadership over the country following Lenin's 1924 death. During Stalin's rule, \"Socialism in One Country\" became a central tenet of the party's dogma. Under the Five-Year Plans, the country underwent agricultural collectivisation and rapid industrialization, creating a centralized command economy. This led to significant disruptions in food production that contributed to the famine of 1932–33. To eradicate accused \"enemies of the working class\", Stalin instituted the \"Great Purge\", in which over a million were imprisoned and at least 700,000 executed between 1934 and 1939.\nStalin's government promoted Marxism–Leninism abroad through the Communist International and supported anti-fascist movements throughout Europe during the 1930s, particularly in the Spanish Civil War. In 1939, it signed a non-aggression pact with Nazi Germany, resulting in the Soviet invasion of Poland. Germany ended the pact by invading the Soviet Union in 1941. Despite initial setbacks, the Soviet Red Army repelled the German incursion and captured Berlin in 1945, ending World War II in Europe. The Soviets annexed the Baltic states and helped establish Soviet-aligned governments throughout Central and Eastern Europe, China and North Korea. The Soviet Union and the United States emerged from the war as the two world superpowers. Tensions arose between the Soviet-backed Eastern Bloc and U.S.-backed Western Bloc which became known as the Cold War. Stalin led his country through its post-war reconstruction, during which it developed a nuclear weapon in 1949. In these years, the country experienced another major famine and an anti-semitic campaign peaking in the Doctors' plot. Stalin died in 1953 and was eventually succeeded by Nikita Khrushchev, who denounced his predecessor and initiated a de-Stalinisation process throughout Soviet society.\nWidely considered one of the 20th century's most significant figures, Stalin was the subject of a pervasive personality cult within the international Marxist–Leninist movement which revered him as a champion of the working class and world socialism. Since the dissolution of the Soviet Union in 1991, Stalin has retained popularity in Russia and Georgia as a victorious wartime leader who established the Soviet Union as a major world power. Conversely, his totalitarian government has been widely condemned for overseeing mass repressions, ethnic cleansing, hundreds of thousands of executions, and famines which killed millions."
  }
]
